devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
/*=========================================================================*//**
@file    spi.c

@author  Daniel Zorychta

@brief   SPI driver

@note    Copyright (C) 2013 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "core/module.h"
#include <dnx/thread.h>
#include <dnx/misc.h>
#include "stm32f1/spi_cfg.h"
#include "stm32f1/spi_def.h"
#include "stm32f1/stm32f10x.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define MUTEX_TIMOUT                    MAX_DELAY_MS
#define SEMAPHORE_TIMEOUT               MAX_DELAY_MS

/* calculate max number of slaves for all SPI peripherals (calculate array size) */
#if (_SPI1_NUMBER_OF_SLAVES > _SPI2_NUMBER_OF_SLAVES)
#define _SPI_NUMBER_OF_SLAVES_A         _SPI1_NUMBER_OF_SLAVES
#else
#define _SPI_NUMBER_OF_SLAVES_A         _SPI2_NUMBER_OF_SLAVES
#endif

#if (_SPI2_NUMBER_OF_SLAVES > _SPI3_NUMBER_OF_SLAVES)
#define _SPI_NUMBER_OF_SLAVES_B         _SPI2_NUMBER_OF_SLAVES
#else
#define _SPI_NUMBER_OF_SLAVES_B         _SPI3_NUMBER_OF_SLAVES
#endif

#if (_SPI_NUMBER_OF_SLAVES_A > _SPI_NUMBER_OF_SLAVES_B)
#define MAX_NUMBER_OF_CS                _SPI_NUMBER_OF_SLAVES_A
#else
#define MAX_NUMBER_OF_CS                _SPI_NUMBER_OF_SLAVES_B
#endif

#if (MAX_NUMBER_OF_CS > 8)
#error SPI module: set up to 8 slaves per device!
#elif (MAX_NUMBER_OF_CS == 0)
#error SPI module: set more than 0 slaves per device!
#endif

/*==============================================================================
  Local object types
==============================================================================*/
MODULE_NAME("SPI");

/* configuration of single CS line (port and pin) */
struct cs_pin_cfg {
        GPIO_t *const           port;
        u16_t                   pin_mask;
};

/* priority configuration */
struct spi_priority_cfg {
        IRQn_Type               IRQn;
        u32_t                   priority;
};

/* independent SPI instance */
struct spi_virtual {
        u8_t                    major;
        u8_t                    minor;
        struct SPI_config       config;
        dev_lock_t              file_lock;
};

/* general module data */
struct module {
        sem_t                  *wait_irq_sem[_SPI_NUMBER];
        mutex_t                *device_protect_mtx[_SPI_NUMBER];
        const u8_t             *tx_buffer[_SPI_NUMBER];
        u8_t                   *rx_buffer[_SPI_NUMBER];
        size_t                  count[_SPI_NUMBER];
        bool                    RAW[_SPI_NUMBER];
        u8_t                    dummy_byte[_SPI_NUMBER];
        u8_t                    number_of_virtual_spi[_SPI_NUMBER];
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static stdret_t spi_turn_on             (SPI_t *spi);
static void     spi_turn_off            (SPI_t *spi);
static void     config_apply            (struct spi_virtual *vspi);
static void     config_apply_safe       (u8_t major);
static void     slave_select            (u8_t major, u8_t minor);
static void     slave_deselect          (u8_t major);
static void     handle_irq              (u8_t major);

/*==============================================================================
  Local objects
==============================================================================*/
/* SPI peripherals address */
static SPI_t *const spi[_SPI_NUMBER] = {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        SPI1,
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        SPI2,
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        SPI3
        #endif
};

/* CS port configuration */
static const struct cs_pin_cfg spi_cs_pin_cfg[_SPI_NUMBER][MAX_NUMBER_OF_CS] = {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        {
                #if (MAX_NUMBER_OF_CS >= 1)
                {.port = (GPIO_t *)_SPI1_CS0_PORT, .pin_mask = _SPI1_CS0_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 2)
                {.port = (GPIO_t *)_SPI1_CS1_PORT, .pin_mask = _SPI1_CS1_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 3)
                {.port = (GPIO_t *)_SPI1_CS2_PORT, .pin_mask = _SPI1_CS2_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 4)
                {.port = (GPIO_t *)_SPI1_CS3_PORT, .pin_mask = _SPI1_CS3_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 5)
                {.port = (GPIO_t *)_SPI1_CS4_PORT, .pin_mask = _SPI1_CS4_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 6)
                {.port = (GPIO_t *)_SPI1_CS5_PORT, .pin_mask = _SPI1_CS5_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 7)
                {.port = (GPIO_t *)_SPI1_CS6_PORT, .pin_mask = _SPI1_CS6_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 8)
                {.port = (GPIO_t *)_SPI1_CS7_PORT, .pin_mask = _SPI1_CS7_PIN_BM}
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        {
                #if (MAX_NUMBER_OF_CS >= 1)
                {.port = (GPIO_t *)_SPI2_CS0_PORT, .pin_mask = _SPI2_CS0_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 2)
                {.port = (GPIO_t *)_SPI2_CS1_PORT, .pin_mask = _SPI2_CS1_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 3)
                {.port = (GPIO_t *)_SPI2_CS2_PORT, .pin_mask = _SPI2_CS2_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 4)
                {.port = (GPIO_t *)_SPI2_CS3_PORT, .pin_mask = _SPI2_CS3_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 5)
                {.port = (GPIO_t *)_SPI2_CS4_PORT, .pin_mask = _SPI2_CS4_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 6)
                {.port = (GPIO_t *)_SPI2_CS5_PORT, .pin_mask = _SPI2_CS5_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 7)
                {.port = (GPIO_t *)_SPI2_CS6_PORT, .pin_mask = _SPI2_CS6_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 8)
                {.port = (GPIO_t *)_SPI2_CS7_PORT, .pin_mask = _SPI2_CS7_PIN_BM}
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        {
                #if (MAX_NUMBER_OF_CS >= 1)
                {.port = (GPIO_t *)_SPI3_CS0_PORT, .pin_mask = _SPI3_CS0_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 2)
                {.port = (GPIO_t *)_SPI3_CS1_PORT, .pin_mask = _SPI3_CS1_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 3)
                {.port = (GPIO_t *)_SPI3_CS2_PORT, .pin_mask = _SPI3_CS2_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 4)
                {.port = (GPIO_t *)_SPI3_CS3_PORT, .pin_mask = _SPI3_CS3_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 5)
                {.port = (GPIO_t *)_SPI3_CS4_PORT, .pin_mask = _SPI3_CS4_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 6)
                {.port = (GPIO_t *)_SPI3_CS5_PORT, .pin_mask = _SPI3_CS5_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 7)
                {.port = (GPIO_t *)_SPI3_CS6_PORT, .pin_mask = _SPI3_CS6_PIN_BM},
                #endif
                #if (MAX_NUMBER_OF_CS >= 8)
                {.port = (GPIO_t *)_SPI3_CS7_PORT, .pin_mask = _SPI3_CS7_PIN_BM}
                #endif
        }
        #endif
};

/* number of SPI cs */
static const u8_t spi_number_of_slaves[_SPI_NUMBER] = {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        _SPI1_NUMBER_OF_SLAVES,
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        _SPI2_NUMBER_OF_SLAVES,
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        _SPI3_NUMBER_OF_SLAVES
        #endif
};

/* IRQ configurations */
static const struct spi_priority_cfg spi_irq[_SPI_NUMBER] = {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        {.IRQn = SPI1_IRQn, .priority = _SPI1_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        {.IRQn = SPI2_IRQn, .priority = _SPI2_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        {.IRQn = SPI3_IRQn, .priority = _SPI3_IRQ_PRIORITY}
        #endif
};

/* default SPI config */
static const struct SPI_config spi_default_cfg = {
        .dummy_byte  = _SPI_DEFAULT_CFG_DUMMY_BYTE,
        .clk_divider = _SPI_DEFAULT_CFG_CLK_DIVIDER,
        .mode        = _SPI_DEFAULT_CFG_MODE,
        .msb_first   = _SPI_DEFAULT_CFG_MSB_FIRST
};

/* pointers to memory of specified device */
static struct module *spi_module;

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(SPI, void **device_handle, u8_t major, u8_t minor)
{
        if (major >= _SPI_NUMBER) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }

#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        if (major == _SPI1 && minor >= _SPI1_NUMBER_OF_SLAVES) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }
#endif

#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        if (major == _SPI2 && minor >= _SPI2_NUMBER_OF_SLAVES) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }
#endif

#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        if (major == _SPI3 && minor >= _SPI3_NUMBER_OF_SLAVES) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }
#endif

        /* allocate module general data if initialized first time */
        if (!spi_module) {
                spi_module = calloc(1, sizeof(struct module));
                if (!spi_module) {
                        return STD_RET_ERROR;
                }
        }

        /* create irq semaphore */
        if (!spi_module->wait_irq_sem[major]) {
                spi_module->wait_irq_sem[major] = semaphore_new(1, 0);
                if (!spi_module->wait_irq_sem[major]) {
                        return STD_RET_ERROR;
                }
        }

        /* create protection mutex and start device if initialized first time */
        if (!spi_module->device_protect_mtx[major]) {
                spi_module->device_protect_mtx[major] = mutex_new(MUTEX_RECURSIVE);
                if (!spi_module->device_protect_mtx[major]) {
                        semaphore_delete(spi_module->wait_irq_sem[major]);
                        spi_module->wait_irq_sem[major] = NULL;
                        return STD_RET_ERROR;
                } else {
                        if (spi_turn_on(spi[major]) == STD_RET_OK) {
                                NVIC_EnableIRQ(spi_irq[major].IRQn);
                                NVIC_SetPriority(spi_irq[major].IRQn, spi_irq[major].priority);
                        } else {
                                semaphore_delete(spi_module->wait_irq_sem[major]);
                                spi_module->wait_irq_sem[major] = NULL;
                                mutex_delete(spi_module->device_protect_mtx[major]);
                                spi_module->device_protect_mtx[major] = NULL;
                                errno = EADDRINUSE;
                                return STD_RET_ERROR;
                        }
                }
        }

        /* create new instance for specified major-minor number (virtual spi) */
        struct spi_virtual *hdl = calloc(1, sizeof(struct spi_virtual));
        if (hdl) {
                hdl->config    = spi_default_cfg;
                hdl->major     = major;
                hdl->minor     = minor;
                *device_handle = hdl;

                spi_module->number_of_virtual_spi[major]++;
        } else {
                return STD_RET_ERROR;
        }

