devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
                        n = count;

                        mutex_unlock(spi_module->device_protect_mtx[hdl->major]);
                } else {
                        errno = ETIME;
                }
        } else {
                errno = EACCES;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(SPI, void *device_handle, int request, void *arg)
{
        struct spi_virtual *hdl    = device_handle;
        stdret_t            status = STD_RET_ERROR;

        if (device_is_access_granted(&hdl->file_lock)) {
                switch (request) {
                case IOCTL_SPI__SET_CONFIGURATION:
                        if (arg) {
                                hdl->config = *reinterpret_cast(struct SPI_config*, arg);
                                status      = STD_RET_OK;
                        } else {
                                errno = EINVAL;
                        }
                        break;

                case IOCTL_SPI__GET_CONFIGURATION:
                        if (arg) {
                                *reinterpret_cast(struct SPI_config*, arg) = hdl->config;
                                status = STD_RET_OK;
                        } else {
                                errno = EINVAL;
                        }
                        break;

                case IOCTL_SPI__SELECT:
                        if (mutex_lock(spi_module->device_protect_mtx[hdl->major], 0)) {
                                spi_module->RAW[hdl->major] = true;
                                config_apply(hdl);
                                slave_deselect(hdl->major);
                                slave_select(hdl->major, hdl->minor);
                                status = STD_RET_OK;
                        } else {
                                errno = EBUSY;
                        }
                        break;

                case IOCTL_SPI__DESELECT:
                        if (mutex_lock(spi_module->device_protect_mtx[hdl->major], 0)) {
                                slave_deselect(hdl->major);
                                config_apply_safe(hdl->major);
                                spi_module->RAW[hdl->major] = false;
                                status = STD_RET_OK;
                        } else {
                                errno = EBUSY;
                        }
                        break;

                case IOCTL_SPI__TRANSCEIVE:
                        if (arg) {
                                struct SPI_transceive *trans = arg;

                                if (trans->count && trans->rx_buffer && trans->tx_buffer) {
                                        if (mutex_lock(spi_module->device_protect_mtx[hdl->major], 0)) {
                                                spi_module->tx_buffer[hdl->major]  = trans->tx_buffer;
                                                spi_module->rx_buffer[hdl->major]  = trans->rx_buffer;
                                                spi_module->count[hdl->major]      = trans->count;

                                                if (spi_module->RAW[hdl->major] == false) {
                                                        slave_deselect(hdl->major);
                                                        config_apply(hdl);
                                                        slave_select(hdl->major, hdl->minor);
                                                }

                                                SET_BIT(spi[hdl->major]->CR2, SPI_CR2_TXEIE);
                                                semaphore_wait(spi_module->wait_irq_sem[hdl->major], SEMAPHORE_TIMEOUT);

                                                mutex_unlock(spi_module->device_protect_mtx[hdl->major]);
                                                status = STD_RET_OK;
                                        }
                                } else {
                                        errno = EINVAL;
                                }
                        } else {
                                errno = EINVAL;
                        }
                        break;

                default:
                        errno = EBADRQC;
                        break;
                }
        } else {
                errno = EACCES;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_FLUSH(SPI, void *device_handle)
{
        UNUSED_ARG(device_handle);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(SPI, void *device_handle, struct vfs_dev_stat *device_stat)
{
        struct spi_virtual *hdl = device_handle;

        device_stat->st_major = hdl->major;
        device_stat->st_minor = hdl->minor;
        device_stat->st_size  = 0;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function enable SPI interface
 *
 * @param[in] *spi      spi peripheral
 *
 * @return STD_RET_OK, STD_RET_ERROR
 */
//==============================================================================
static stdret_t spi_turn_on(SPI_t *spi)
{
        switch ((uint32_t)spi) {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        case SPI1_BASE:
                if (!(RCC->APB2ENR & RCC_APB2ENR_SPI1EN)) {
                        RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                        RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                        RCC->APB2ENR  |=  RCC_APB2ENR_SPI1EN;
                        return STD_RET_OK;
                } else {
                        return STD_RET_ERROR;
                }
                break;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        case SPI2_BASE:
                if (!(RCC->APB1ENR & RCC_APB1ENR_SPI2EN)) {
                        RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                        RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                        RCC->APB1ENR  |=  RCC_APB1ENR_SPI2EN;
                        return STD_RET_OK;
                } else {
                        return STD_RET_ERROR;
                }
                break;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        case SPI3_BASE:
                if (!(RCC->APB1ENR & RCC_APB1ENR_SPI3EN)) {
                        RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                        RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                        RCC->APB1ENR  |=  RCC_APB1ENR_SPI3EN;
                        return STD_RET_OK;
                } else {
                        return STD_RET_ERROR;
                }
                break;
        #endif
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function disable SPI interface
 *
 * @param[in] *spi      spi peripheral
 */
//==============================================================================
static void spi_turn_off(SPI_t *spi)
{
        switch ((uint32_t)spi) {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_SPI1EN;
                break;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI2EN;
                break;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI3EN;
                break;
        #endif
        }
}

//==============================================================================
/**
 * @brief Function apply new configuration for selected SPI
 *
 * @param vspi          virtual spi handler
 */
//==============================================================================
static void config_apply(struct spi_virtual *vspi)
{
        const u16_t divider_mask[SPI_CLK_DIV_256 + 1] = {
                [SPI_CLK_DIV_2  ] 0x00,
                [SPI_CLK_DIV_4  ] SPI_CR1_BR_0,
                [SPI_CLK_DIV_8  ] SPI_CR1_BR_1,
                [SPI_CLK_DIV_16 ] SPI_CR1_BR_1 | SPI_CR1_BR_0,
                [SPI_CLK_DIV_32 ] SPI_CR1_BR_2,
                [SPI_CLK_DIV_64 ] SPI_CR1_BR_2 | SPI_CR1_BR_0,
                [SPI_CLK_DIV_128] SPI_CR1_BR_2 | SPI_CR1_BR_1,
                [SPI_CLK_DIV_256] SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0,
        };

        const u16_t spi_mode_mask[SPI_MODE_3 + 1] = {
                [SPI_MODE_0] 0x00,
                [SPI_MODE_1] SPI_CR1_CPHA,
                [SPI_MODE_2] SPI_CR1_CPOL,
                [SPI_MODE_3] SPI_CR1_CPOL | SPI_CR1_CPHA
        };

        SPI_t *SPI = spi[vspi->major];

        /* configure SPI divider */
        CLEAR_BIT(SPI->CR1, SPI_CR1_BR);
        SET_BIT(SPI->CR1, divider_mask[vspi->config.clk_divider]);

        /* configure SPI mode */
        CLEAR_BIT(SPI->CR1, SPI_CR1_CPOL | SPI_CR1_CPHA);
        SET_BIT(SPI->CR1, spi_mode_mask[vspi->config.mode]);

        /* 8-bit mode */
        CLEAR_BIT(SPI->CR1, SPI_CR1_DFF);

        /* set MSB/LSB */
        if (vspi->config.msb_first)
                CLEAR_BIT(SPI->CR1, SPI_CR1_LSBFIRST);
        else
                SET_BIT(SPI->CR1, SPI_CR1_LSBFIRST);

        /* NSS software mode */
        SET_BIT(SPI->CR1, SPI_CR1_SSM | SPI_CR1_SSI);

        /* set SPI as master */
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);

